bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/edc/ATSAMC21J17A.PIC
      <edc:SFRDef edc:_addr="0x40000814" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="APBAMASK" edc:impl="0x1FFF" edc:mclr="00000000000000000000111111111111" edc:nzwidth="0x20" edc:por="00000000000000000000111111111111" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="PAC_" edc:desc="PAC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:desc="PM APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:desc="MCLK APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:desc="RSTC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:desc="OSCCTRL APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:desc="OSC32KCTRL APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:desc="SUPC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:desc="GCLK APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:desc="WDT APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:desc="RTC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:desc="EIC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:desc="FREQM APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSENS_" edc:desc="TSENS APB Clock Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000818" edc:access="--------------------------n--nnn" edc:cname="APBBMASK" edc:impl="0x27" edc:mclr="00000000000000000000000000000111" edc:nzwidth="0x20" edc:por="00000000000000000000000000000111" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="PORT_" edc:desc="PORT APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:desc="DSU APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:desc="NVMCTRL APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HMATRIXHS_" edc:desc="HMATRIXHS APB Clock Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000081C" edc:access="--------nnnnnnnnnnnnnnn--nnnnnnn" edc:cname="APBCMASK" edc:impl="0xFFFE7F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:desc="EVSYS APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:desc="SERCOM0 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:desc="SERCOM1 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:desc="SERCOM2 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:desc="SERCOM3 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM4_" edc:desc="SERCOM4 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM5_" edc:desc="SERCOM5 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:desc="TCC0 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC1_" edc:desc="TCC1 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:desc="TCC2 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:desc="TC0 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:desc="TC1 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:desc="TC2 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC3_" edc:desc="TC3 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC4_" edc:desc="TC4 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC0_" edc:desc="ADC0 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC1_" edc:desc="ADC1 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SDADC_" edc:desc="SDADC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:desc="AC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:desc="DAC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:desc="PTC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:desc="CCL APB Clock Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000820" edc:offset="0x3E0"/>
      <edc:SFRDef edc:_addr="0x40000C00" edc:access="-rrr-rrr" edc:cname="RCAUSE" edc:impl="0x77" edc:nzwidth="0x8" ltx:memberofperipheral="RSTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="POR" edc:desc="Power On Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODCORE" edc:desc="Brown Out CORE Detector Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODVDD" edc:desc="Brown Out VDD Detector Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EXT" edc:desc="External Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT" edc:desc="Watchdog Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYST" edc:desc="System Reset Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
