bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/edc/ATSAMC21J17A.PIC
      <edc:SFRDef edc:_addr="0x4100800C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BASE" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41008010" edc:offset="0xEF0"/>
      <edc:SFRDef edc:_addr="0x41008F00" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ITCTRL" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41008F04" edc:offset="0x9C"/>
      <edc:SFRDef edc:_addr="0x41008FA0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLAIMSET" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FA4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLAIMCLR" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41008FA8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x41008FB0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKACCESS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FB4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="LOCKSTATUS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FB8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="AUTHSTATUS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FBC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVARCH" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41008FC0" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x41008FC8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVID" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FCC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVTYPE" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FD0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID4" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FD4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID5" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID6" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID7" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FE0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID0" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FE4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID1" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FE8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID2" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FEC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID3" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FF0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID0" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FF4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID1" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FF8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID2" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FFC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID3" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41009000" edc:offset="0x1000"/>
      <edc:SFRDef edc:_addr="0x4100A000" edc:access="-----------------------------nnn" edc:cname="MCFG0" edc:impl="0x7" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="ULBT" edc:desc="Undefined Length Burst Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="INFINITE" edc:desc="Infinite Length" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single Access" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FOUR_BEAT" edc:desc="Four Beat Burst" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="EIGHT_BEAT" edc:desc="Eight Beat Burst" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="SIXTEEN_BEAT" edc:desc="Sixteen Beat Burst" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A004" edc:access="-----------------------------nnn" edc:cname="MCFG1" edc:impl="0x7" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="ULBT" edc:desc="Undefined Length Burst Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="INFINITE" edc:desc="Infinite Length" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single Access" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FOUR_BEAT" edc:desc="Four Beat Burst" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="EIGHT_BEAT" edc:desc="Eight Beat Burst" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="SIXTEEN_BEAT" edc:desc="Sixteen Beat Burst" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
