bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/edc/ATSAMC21J17A.PIC
      <edc:SFRDef edc:_addr="0x4100A078" edc:access="-------n--nnnnnn--------nnnnnnnn" edc:cname="SCFG14" edc:impl="0x13F00FF" edc:mclr="00000000000000000000000000010000" edc:nzwidth="0x20" edc:por="00000000000000000000000000010000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:desc="Maximum Number of Allowed Cycles for a Burst" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:desc="Default Master Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LAST_DEFAULT" edc:desc="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_DEFAULT" edc:desc="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:desc="Fixed Index of Default Master" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ARBT" edc:desc="Arbitration Type" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ROUND_ROBIN" edc:desc="Round-Robin Arbitration" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_PRIORITY" edc:desc="Fixed Priority Arbitration" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A07C" edc:access="-------n--nnnnnn--------nnnnnnnn" edc:cname="SCFG15" edc:impl="0x13F00FF" edc:mclr="00000000000000000000000000010000" edc:nzwidth="0x20" edc:por="00000000000000000000000000010000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:desc="Maximum Number of Allowed Cycles for a Burst" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:desc="Default Master Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LAST_DEFAULT" edc:desc="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_DEFAULT" edc:desc="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:desc="Fixed Index of Default Master" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ARBT" edc:desc="Arbitration Type" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ROUND_ROBIN" edc:desc="Round-Robin Arbitration" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_PRIORITY" edc:desc="Fixed Priority Arbitration" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A080" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS0PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:desc="Master 4 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:desc="Master 5 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:desc="Master 6 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:desc="Master 7 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A084" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS0PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="M8PR" edc:desc="Master 8 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:desc="Master 9 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:desc="Master 10 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:desc="Master 11 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:desc="Master 12 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:desc="Master 13 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:desc="Master 14 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:desc="Master 15 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A088" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS1PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:desc="Master 4 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:desc="Master 5 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:desc="Master 6 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:desc="Master 7 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A08C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS1PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="M8PR" edc:desc="Master 8 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:desc="Master 9 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:desc="Master 10 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:desc="Master 11 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:desc="Master 12 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:desc="Master 13 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:desc="Master 14 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:desc="Master 15 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A090" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS2PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:desc="Master 4 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:desc="Master 5 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:desc="Master 6 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:desc="Master 7 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A094" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS2PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="M8PR" edc:desc="Master 8 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:desc="Master 9 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:desc="Master 10 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:desc="Master 11 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:desc="Master 12 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:desc="Master 13 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:desc="Master 14 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:desc="Master 15 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A098" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS3PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:desc="Master 4 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:desc="Master 5 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:desc="Master 6 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:desc="Master 7 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A09C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS3PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="M8PR" edc:desc="Master 8 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:desc="Master 9 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:desc="Master 10 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:desc="Master 11 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:desc="Master 12 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:desc="Master 13 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:desc="Master 14 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:desc="Master 15 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
