bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/edc/ATSAMC21J17A.PIC
      <edc:SFRDef edc:_addr="0x4200400C" edc:access="------nn" edc:cname="WAVE" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC4">
            <edc:SFRFieldDef edc:cname="WAVEGEN" edc:desc="Waveform Generation Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NFRQ" edc:desc="Normal frequency" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MFRQ" edc:desc="Match frequency" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="NPWM" edc:desc="Normal PWM" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="MPWM" edc:desc="Match PWM" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200400D" edc:access="------nn" edc:cname="DRVCTRL" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC4">
            <edc:SFRFieldDef edc:cname="INVEN0" edc:desc="Output Waveform Invert Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEN1" edc:desc="Output Waveform Invert Enable 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200400E" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x4200400F" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC4">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Run During Debug" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004010" edc:access="------------------------rrrrrrrr" edc:cname="SYNCBUSY" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TC4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC4">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="swrst" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:desc="CTRLB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STATUS" edc:desc="STATUS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Period" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC0" edc:desc="Compare Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC1" edc:desc="Compare Channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004014" edc:offset="0x3EC"/>
      <edc:SFRDef edc:_addr="0x42004400" edc:access="nnn---nn" edc:cname="CTRLA" edc:impl="0xE3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SLAVEEN" edc:desc="Slave Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run During Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004401" edc:access="-----nnn" edc:cname="CTRLB" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:desc="Prescaler Configuration" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Peripheral clock / 2" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Peripheral clock / 4" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Peripheral clock / 8" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Peripheral clock / 16" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Peripheral clock / 32" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Peripheral clock / 64" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Peripheral clock / 128" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Peripheral clock / 256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004402" edc:access="n---nnnn" edc:cname="REFCTRL" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="REFSEL" edc:desc="Reference Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="INTREF" edc:desc="Internal Bandgap Reference" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="INTVCC0" edc:desc="1/1.6 VDDANA" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="INTVCC1" edc:desc="1/2 VDDANA" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AREFA" edc:desc="External Reference" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DAC" edc:desc="DAC" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="INTVCC2" edc:desc="VDDANA" edc:when="(field &amp; 0xF) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="REFCOMP" edc:desc="Reference Buffer Offset Compensation Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004403" edc:access="--nnnnnn" edc:cname="EVCTRL" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="FLUSHEI" edc:desc="Flush Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTEI" edc:desc="Start Conversion Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLUSHINV" edc:desc="Flush Event Invert Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTINV" edc:desc="Start Event Invert Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESRDYEO" edc:desc="Result Ready Event Out" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINMONEO" edc:desc="Window Monitor Event Out" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004404" edc:access="-----nnn" edc:cname="INTENCLR" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="RESRDY" edc:desc="Result Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERRUN" edc:desc="Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINMON" edc:desc="Window Monitor Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004405" edc:access="-----nnn" edc:cname="INTENSET" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="RESRDY" edc:desc="Result Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERRUN" edc:desc="Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINMON" edc:desc="Window Monitor Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004406" edc:access="-----nnn" edc:cname="INTFLAG" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="RESRDY" edc:desc="Result Ready Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERRUN" edc:desc="Overrun Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINMON" edc:desc="Window Monitor Interrupt Flag" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
